{
  "bank_account_basics": {
    "who": [
      "Working professionals, students, retirees, and individuals from various walks of life open bank accounts to manage their personal finances. ",
      "TYPES OF ACCOUNT HOLDERS: Primary Account Holder - The person who applied to open a bank account or sign up for a credit card is referred to as the primary account holder. The financial institution uses their financial profile and information to approve or deny the account. Secondary Account Holder - Authorized users of an account who may have restricted access to the functions of the account. In most cases, the secondary account holder has no legal obligations to the account. Joint Account Holder - More common in marriages and families. This account allows multiple people to be considered primary account holders. Any person can add a secondary account holder and are responsible for any legal obligations that come with the account."
    ],
    "what": [
      "A bank account is an account held at a financial institution that allows individuals or businesses to deposit and withdraw funds.",
      "TYPES OF BANK ACCOUNTS: Checkings - A deposit account you can open at a physical bank, credit union, or online bank. Utilized to hold funds for a variety of needs and typically comes with a debit card for making purchases or withdrawals. It can also be linked to other bank accounts. Most have a minimum balance requirement and monthly maintenance fees. Savings - Deposit account used to hold money you don’t plan to spend right away. Most savings accounts provide an interest on deposits. Typically 0.4% annual percentage yield and subjected to a limit of six withdrawals per month. Money Market - A savings account and checkings account all in one. A money market account typically allows you to earn interest on balances, and can also offer debit-card access for spending or payments. Similar to a savings account, you will be limited to a limit of six withdrawals per month. CDs (Certificates of Deposits) - A savings account that exists for a fixed amount of time left untouched for that period of time. During this time, you’ll earn fixed interest on your balance. Withdrawing money before your term end date may lead to an early withdrawal penalty. "
    ],
    "when/where": [
      "Opening a bank account is a personal decision based on your financial goals, convenience, and security preferences. If you find that the benefits align with your short-term and long-term needs, it is a great time to open a bank account.",
      " Opening a bank account can seem intimidating at first, but if you have the following documents, you are good to go: Valid, government-issued photo ID (such as a driver's license or passport) Birth certificate Social Security Number or Tax Identification Number Proof of address (such as a utility bill or lease agreement) Initial deposit If you are opening a joint bank account, you will need identification for all primary account holders. Lastly, don't forget to ask questions during the account opening process! Seek clarification on any fees, account features, or terms and conditions that you may be unsure about. It's important to have a clear understanding of what you're agreeing to."
    ],
    "why": [
      "Safekeeping of funds: Banks provide a secure environment for storing money.",
      "Convenience: Bank accounts offer easy access to funds for day-to-day transactions, bill payments, and online shopping.",
      "Interest earnings: Savings accounts and CDs may generate interest, allowing money to grow over time."
    ],
    "how": [
      "Research different banks or financial institutions to find one that suits your needs in terms of services",
      "Determine the type of account that best fits your requirements. ",
      "Collect the necessary documents needed to open an account.",
      "Depending on the bank, you can either visit a branch in person or apply online through their website. If you're applying online, follow the instructions provided by the bank to complete the application process.",
      "Carefully review the terms and conditions provided by the bank, including any account fees, minimum balance requirements, withdrawal restrictions, and other account-specific details. ",
      "Lastly, activate your new bank account!"
    ]
  }
}
